# Terraform CI/CD

- [x] :paintbrush: Check if all Terraform configuration files are in a canonical format
- [x] :hammer_and_wrench: Validate the configuration files
- [x] :scroll: Generate a speculative execution plan

### Terraform Plan output
```terraform
module.bootstrap_org.github_repository.main: Refreshing state... [id=be.xnku]
module.bootstrap_org.google_project.org_main: Refreshing state... [id=projects/xnk-root]
module.bootstrap_org.google_project_service.main_org_required_api["serviceusage.googleapis.com"]: Refreshing state... [id=xnk-root/serviceusage.googleapis.com]
module.bootstrap_org.google_project_service.main_org_required_api["iam.googleapis.com"]: Refreshing state... [id=xnk-root/iam.googleapis.com]
module.bootstrap_org.google_project_service.main_org_required_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=xnk-root/cloudresourcemanager.googleapis.com]
module.bootstrap_org.google_service_account.automation_github: Refreshing state... [id=projects/xnk-root/serviceAccounts/github-automation@xnk-root.iam.gserviceaccount.com]
module.bootstrap_org.google_organization_iam_binding.org_automation_iam: Refreshing state... [id=294181941896/roles/iam.securityAdmin]
module.bootstrap_org.google_service_account_key.automation_github: Refreshing state... [id=projects/xnk-root/serviceAccounts/github-automation@xnk-root.iam.gserviceaccount.com/keys/1d5053cc1647ce2642b6356ca6d1743bfee468f5]
module.bootstrap_org.github_actions_secret.main_google_application_credentials: Refreshing state... [id=be.xnku:GCP_SA_KEY]
module.bootstrap_org.aws_iam_user.automation_github: Refreshing state... [id=github-automation@xnku.be]
module.bootstrap_org.aws_s3_bucket.terraform_states: Refreshing state... [id=tfstates.xnku.be]
module.bootstrap_org.aws_dynamodb_table.terraform_state_locks: Refreshing state... [id=locks.tfstates.xnku.be]
module.bootstrap_org.aws_iam_policy.automation_iam_group_rw: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/xnku.be/TerraformIAMGroupManager@xnku.be]
module.bootstrap_org.aws_iam_policy.automation_iam_policy_rw: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/xnku.be/TerraformIAMPolicyManager@xnku.be]
module.bootstrap_org.aws_iam_policy.automation_iam_user_rw: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/xnku.be/TerraformIAMUserManager@xnku.be]
module.bootstrap_org.aws_iam_access_key.automation_github: Refreshing state... [id=AKIAYIEXNTTYFJKZTF47]
module.bootstrap_org.aws_iam_user_policy_attachment.automation_github-iam_group_rw: Refreshing state... [id=github-automation@xnku.be-20210714120024466000000003]
module.bootstrap_org.aws_iam_user_policy_attachment.automation_github-iam_user_rw: Refreshing state... [id=github-automation@xnku.be-20210714120024386100000001]
module.bootstrap_org.github_actions_secret.main_aws_secret_access_key: Refreshing state... [id=be.xnku:AWS_SECRET_ACCESS_KEY]
module.bootstrap_org.aws_iam_user_policy_attachment.automation_github-iam_policy_rw: Refreshing state... [id=github-automation@xnku.be-20210714120024401500000002]
module.bootstrap_org.github_actions_secret.main_aws_access_key_id: Refreshing state... [id=be.xnku:AWS_ACCESS_KEY_ID]
module.bootstrap_org.aws_iam_policy.automation_backend_rw: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/xnku.be/TerraformBackendFullAccess@xnku.be]
module.bootstrap_org.aws_iam_policy.terraform_backend_rw: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/TerraformBackendFullAccess]
module.bootstrap_org.aws_iam_policy.terraform_backend_ro: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/TerraformBackendReadOnlyAccess]
module.bootstrap_org.aws_iam_policy.terraform_backend_info: Refreshing state... [id=arn:aws:iam::567253245168:policy/xnk/TerraformBackendMetaAccess]
module.bootstrap_org.aws_iam_user_policy_attachment.automation_github-backend_rw: Refreshing state... [id=github-automation@xnku.be-20210714124646354400000002]
module.bootstrap_org.aws_iam_user_policy_attachment.automation_github-backend_info: Refreshing state... [id=github-automation@xnku.be-20210714124646237300000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.bootstrap_org.github_actions_secret.main_aws_access_key_id has been deleted
  - resource "github_actions_secret" "main_aws_access_key_id" {
      - created_at      = "2021-07-14 13:39:24 +0000 UTC" -> null
      - id              = "be.xnku:AWS_ACCESS_KEY_ID" -> null
      - plaintext_value = (sensitive value)
      - repository      = "be.xnku" -> null
      - secret_name     = "AWS_ACCESS_KEY_ID" -> null
      - updated_at      = "2021-07-14 13:39:24 +0000 UTC" -> null
    }
  # module.bootstrap_org.github_actions_secret.main_aws_secret_access_key has been deleted
  - resource "github_actions_secret" "main_aws_secret_access_key" {
      - created_at      = "2021-07-14 13:39:25 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "be.xnku:AWS_SECRET_ACCESS_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "be.xnku" -> null
      - secret_name     = "AWS_SECRET_ACCESS_KEY" -> null
      - updated_at      = "2021-07-14 13:39:25 +0000 UTC" -> null
    }
  # module.bootstrap_org.github_actions_secret.main_google_application_credentials has been deleted
  - resource "github_actions_secret" "main_google_application_credentials" {
      - created_at      = "2021-07-14 21:43:24 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "be.xnku:GCP_SA_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "be.xnku" -> null
      - secret_name     = "GCP_SA_KEY" -> null
      - updated_at      = "2021-07-14 21:43:24 +0000 UTC" -> null
    }
  # module.bootstrap_org.github_repository.main has been deleted
  - resource "github_repository" "main" {
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = false -> null
      - archive_on_destroy     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "draft/change-repo-architecture" -> null
      - delete_branch_on_merge = true -> null
      - description            = "First organization repository, used to bootstrap the ecosystem." -> null
      - etag                   = "W/\"bcdd5c10ee9b6c9c926b07a15d9159d62f988e90ee6901937e5ec80d70ac4568\"" -> null
      - full_name              = "xnkube/be.xnku" -> null
      - git_clone_url          = "git://github.com/xnkube/be.xnku.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = true -> null
      - has_wiki               = true -> null
      - homepage_url           = "https://xnku.be" -> null
      - html_url               = "https://github.com/xnkube/be.xnku" -> null
      - http_clone_url         = "https://github.com/xnkube/be.xnku.git" -> null
      - id                     = "be.xnku" -> null
      - is_template            = false -> null
      - name                   = "be.xnku" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkzNjMyNDQzNTQ=" -> null
      - private                = false -> null
      - repo_id                = 363244354 -> null
      - ssh_clone_url          = "git@github.com:xnkube/be.xnku.git" -> null
      - svn_url                = "https://github.com/xnkube/be.xnku" -> null
      - topics                 = [
          - "iam",
          - "kubernetes",
          - "organization",
          - "terraform",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bootstrap_org.github_actions_secret.main_aws_access_key_id will be created
  + resource "github_actions_secret" "main_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "be.xnku"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap_org.github_actions_secret.main_aws_secret_access_key will be created
  + resource "github_actions_secret" "main_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "be.xnku"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap_org.github_actions_secret.main_google_application_credentials will be created
  + resource "github_actions_secret" "main_google_application_credentials" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "be.xnku"
      + secret_name     = "GCP_SA_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap_org.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = false
      + allow_squash_merge     = false
      + archive_on_destroy     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "First organization repository, used to bootstrap the ecosystem."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + homepage_url           = "https://xnku.be"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "be.xnku"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "iam",
          + "kubernetes",
          + "organization",
          + "terraform",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # module.iam.module.group_bots.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Organization bots, mainly for automation purpose."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "bots"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_owner.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Organization owners, with all power (and all responsibilities)."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "owner"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "sre-engineers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_devops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "devops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_ops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_secops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing security of the infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "secops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.user_xnbot.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xnbot"
    }

  # module.iam.module.user_xnbot.github_team_membership.team_memberships["bots"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xnbot"
    }

  # module.iam.module.user_xunleii.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xunleii"
    }

  # module.iam.module.user_xunleii.github_team_membership.team_memberships["owner"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "xunleii"
    }

  # module.iam.module.user_xunleii.github_team_membership.team_memberships["sre-engineers"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xunleii"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - act_secret_file               = (sensitive value)
  - bootstrap_automation_accounts = (sensitive value)

Warning: Experimental feature "module_variable_optional_attrs" is active

  on iam/modules/group/version.tf line 15, in terraform:
  15:   experiments      = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: c47288e6289cb60a6795c5347981ace25fe559b9.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "c47288e6289cb60a6795c5347981ace25fe559b9.tfplan"
Releasing state lock. This may take a few moments...

```

#
> _Report based on commit c47288e6289cb60a6795c5347981ace25fe559b9 (authored by **@xunleii**).  See [`actions#1040355696`](https://github.com/xnkube/be.xnku/actions/runs/1040355696) for more details._
<!-- Sticky Pull Request Comment -->